{
    "I have problems at my workplace":{
        "Do you face low energy levels after a day at work?":{
            "questions":[
                    "How much have your sleeping habits changed since you started work here?",
                    "How much has your appetite changed since you started working here?",
                    "How moody are you at work?",
                    "How much have your relationships suffered as a result of work?",
                    "How much of your outside commitments (anything you do other than work, e.g. basketball) suffered because of work?"
            ]
        },
        "Do you ever worry about finances?":{
            "questions":[
                "How satisfied are you with your salary?",
                "How much do you worry about losing your job?",
                "How upset are you during your payday?",
                "Assuming no privacy issues, are you feeling comfortable letting other people know your salary?",
                "How much do you worry about meeting your expenses?"
            ]
        },
        "Do you feel confident at work?":{
            "questions":[
                "How comfortable are you with your bosses and colleagues?",
                "Do you see yourself as a capable person?",
                "How much do you struggle on completing tasks of your work?",
                "How often do you work under pressure?",
                "How will you rate your mental state at work? Really good is 10, really bad is 1"
            ]
        }
        
    },

    "I have problems in school":{

        "Are you not willing to go to school?":{
            "questions":[
                "How comfortable are you in the class? ",
                "How well are you able to cope up with the subjects?",
                "How difficult are you when you are facing the faculty?"
            ]
        },

        "Are you not happy with your grades?":{
            "questions":[
                "How much satisfied are you after receiving your grades? ",
                "How much are the external factors affecting your grades? ",
                "How much is the effort put for studying reflecting in your grades?",
                "How much scared are you for exams overnight?"
            ]
        },

        "Do you face bullying at school?":{
            "questions":[
                "Rate the severity of bullying you are facing",
                "How much traumatized are you after bullying ?"
            ]
        }
    },

    "I have problems with personal relationship":{
        "Do you have any issues with your family?":{
            "questions":[
                "How much is your family issue affecting your mental health?",
                "How well connected are you with your family?",
                "How well does your family support you?",
                "How much pressure are you facing from your family?"
            ]
        },

        "Are you facing any problems in love?":{
            "questions":[
                "How well connected are you and your partner?",
                "How much does your partner understands you?"
            ]
        },

        "Do you face any difficulties in expressing your opinions?":{
            "questions":[
                "How well is your relationship with your relatives?",
                "How well do you communicate with people?"
            ]
        }


    }




}